Revit 2026 API

# TransformBasis Property

---

Defines the basis of the old coordinate system in the new coordinate system.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ this[
	int idx
] { get; set; }
```
```vb
Public Property Basis (
	idx As Integer
) As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Basis[int idx] {
	XYZ^ get (int idx);
	void set (int idx, XYZ^ value);
}
```
```fsharp
member Basis : XYZ with get, set
```

#### Parameters

idx Int32
    The index of the basis vector: 0, 1 or 2.

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Thrown when the given index is larger than 2 in the getter and setter. |
| InvalidOperationException | Thrown when the transform is internally marked as read-only. |

This corresponds to the first three column vectors of the conventional 3x4 matrix representation.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace